package model;

import java.util.Map;

import assist.ExtractEntityMethod;

/**
 * 使用规则生成一篇文章,构造出模板,然后通过抽取实体填空,形成新的文章.
 * @author huwenhao
 *
 */

public class GenerateArticleByRule {

    public static void main(String[] args) {
        String article = "1=月=12=日=，=[nt]=土地=拍卖=开=[ng]=，=位于=[ns]=的=5=宗=[j]=用地=进行=[s]=拍卖=，=[d]=全部=以=底价=成交=，=[nz]=6425万=元=,=其中=位于=[ns]=[ns]=[f]=、=[nt]=[f]=、=[nt]=[f]=、=规划=路=[f]=的=三=宗=[b]=地块=的=出让=年限=[d]=[d]=到=商业=40=年=，=住宅=70=年=,=三=宗=地块=的=商业=部分=出让=年限=截止=到=2055=年=7=月=9=[j]=，=住宅=部分=出让=年限=截止=到=2085=年=7=月=9=[j]=，=[d]=比=正常=的=商业=产权=[c]=住宅=产权=少=了=1=年=半=,=JY=16=-=66=     =土地=位置=,=[ns]=[b]=经济=开发区=蓝色=新区=[nz]=[f]=、=[nr]=[nz]=路=[f]=、=用地=界线=[f]=、=[ns]=[f]=     =土地=面积=,=10355=㎡     =土地=用途=,=商业=     =[nz]=,=2.7=     =建筑=密度=,=35=%=     =[nz]=,=15=%=     =规划=建=面=,=279582=平米=     =成交=[nz]=地价=,=945=元=/=㎡     =成交=总价=,=2642.03万=元=     =[nz]=,=0=     =[nz]=人=,=[ns]=[d]=发=[nr]=新区=置业=有限公司=     =JY=16=-=67=     =土地=位置=,=[ns]=[b]=经济=开发区=蓝色=新区=[nz]=路=[f]=、=[nt]=[f]=     =土地=面积=,=10622=㎡     =土地=用途=,=商业=     =[nz]=,=2=     =建筑=密度=,=45=%=     =[nz]=,=25=%=     =规划=建=面=,=21244=平米=     =成交=[nz]=地价=,=1134=元=/=㎡     =成交=总价=,=2409.07万=元=     =[nz]=,=0=     =[nz]=人=,=[ns]=[nr]=[nt]=     =JY=16=-=68=     =土地=位置=,=[ns]=[ns]=[ns]=[f]=、=[nt]=[f]=、=[nt]=[f]=、=规划=路=[f]=     =土地=面积=,=3264=㎡     =土地=用途=,=商业=     =[nz]=,=0.4=     =建筑=密度=,=45=%=     =[nz]=,=25=%=     =规划=建=面=,=1305=平米=     =成交=[nz]=地价=,=3542=元=/=㎡     =成交=总价=,=462.23万=元=     =[nz]=,=0=     =[nz]=人=,=[nt]=     =JY=16=-=69=     =土地=位置=,=[ns]=[ns]=[ns]=[f]=、=[nt]=[f]=、=[nt]=[f]=、=规划=路=[f]=     =土地=面积=,=5161=㎡     =土地=用途=,=住宅=兼容=商业=     =[nz]=,=1.1=     =建筑=密度=,=30=%=     =[nz]=,=25=%=     =规划=建=面=,=5677=平米=     =成交=[nz]=地价=,=1489=元=/=㎡     =成交=总价=,=845.31万=元=     =[nz]=,=0=     =[nz]=人=,=[nt]=     =JY=16=-=70=     =土地=位置=,=[ns]=[ns]=[ns]=[f]=、=[nt]=[f]=、=[nt]=[f]=、=规划=路=[f]=     =土地=面积=,=405=㎡     =土地=用途=,=住宅=兼容=商业=     =[nz]=,=1.1=     =建筑=密度=,=30=%=     =[nz]=,=25=%=     =规划=建=面=,=445=平米=     =成交=[nz]=地价=,=1494=元=/=㎡     =成交=总价=,=66.48万=元=     =[nz]=,=0=     =[nz]=人=,=[nt]=,";
		
	    String file = "/home/min/workspace/data/ajk_zixun/ajk_zixun_text.txt";
	    Map<String, Map<String, Integer>> posWord = ExtractEntityMethod.statisticPOSWordCount(file);
	    GenerateSentenceByRule.getText(article, posWord);
    }

}
